//学生数据
var studentData = [];
//班级数据
var classData = [];
//姓名数组
var nameArr = ['弗拉基米尔', '希维尔', '蒙多', '茂凯','潘森','波比','拉克丝','索拉卡','娑娜','伊泽瑞尔','费德提克','雷克顿','古拉加斯','卡萨丁','迦娜','提莫','奥莉安娜','嘉文四世','莫德凯撒','努努','普朗克','崔丝塔娜','艾瑞莉娅','沃里克','厄运小姐','库奇','布兰德','阿卡丽','卡尔玛','李青','凯南','盖伦','艾希','泰达米尔','塔里克','维迦','贾克斯','薇恩','莫甘娜','玛尔扎哈','基兰','兰博','特朗德尔','辛吉德','斯维因','卡西奥佩娅','卡尔萨斯','安妮','凯特琳','伊芙琳','图奇','凯尔','科加斯','奥拉夫','阿木木','加里奥','布里茨','黑默丁格','崔斯特','墨菲特','内瑟斯','克格莫','易','赵信','奈德丽','阿利斯塔','拉莫斯','厄加特','慎','瑞兹','艾尼维亚','卡特琳娜','乌迪尔','赛恩','萨科','乐芙兰','魔腾','昆卡','普罗德摩尔','雷克萨','布莱德瓦登','雷格石蹄','普瑞斯特','曼吉斯','史文','凯林','鲁服崔伦','暗黑酿酒师','拉泽尔','黎格沃','瑞托崔普','达维安爵士','马格纳斯','哈斯卡','克里瑟历斯','巴拉森','里拜尔森','蒙哥','卡恩','涅沙','路西法','奈克斯','阿帕顿','贝内哈洛','巴拉那','阿兹加洛','帕吉','李奥瑞克王','斯拉达','迪尔格','玛吉纳','卡德','由涅若','悉拉贝尔','露娜','司里希丝','艾瑞斯','蜜拉娜','力丸','贾拉寇','冈达','崔希丝','暗惧者','米波','瑞勒','美杜莎','拉娜娅','阿富瑟','仙德莎','史德利古尔','克林克兹','布蕾克','爱拉琪妮雅','阿努巴拉克','尔纳布瑟伦','末崔蒂','奈门摩尔','恐惧之刃','墨丘利','里榭尔使','蝮蛇','克丽丝芙','爱由莎','帕克','艾萨罗','宙斯','法里奥','诺崇','莉娜茵巴丝','莱金','奥蕾莉亚','金扎卡','史奎','米里吉','阿格隆','戴佐','罗斯塔','鲍西','雷斯瑞克','贾奇洛','沃尔金','雅特罗波斯','依许卡菲尔','克萝贝露丝','莱昂','达克罗','克尔苏加德','罗坦德吉利','帕格纳','阿卡莎','莱尼克','塔尔','乌瑞恩','洛萨','瓦里安','安度因','伯瓦尔弗塔根','卡特拉娜','普瑞斯托','雷吉纳德','温德索尔','本尼迪塔斯','麦格尼','穆拉丁','茉艾拉','索瑞森','弗斯塔德','布莱恩','泰兰德','玛法里奥','范达尔','加洛德','珊蒂斯','阿隆索斯','乌瑟尔','图拉扬','弗丁','达索汉','莫格莱尼','加文拉德','卡德加','库德兰','托尔贝恩','罗宁','普罗德摩尔','温蕾萨','瓦蕾拉','埃德温','萨萨里安','宋江', '卢俊义', '吴用', '公孙胜', '关胜', '林冲', '秦明', '呼延灼', '花荣', '柴进', '李应', '朱仝', '鲁智深', '武松', '董平', '张清', '杨志', '徐宁', '索超', '戴宗', '刘唐', '李逵', '史进', '穆弘', '雷横', '李俊', '阮小二', '张横', '阮小五', '张顺', '阮小七', '杨雄', '石秀', '解珍', '解宝', '燕青', '朱武', '黄信', '孙立', '宣赞', '郝思文', '韩滔', '彭玘', '单廷圭', '魏定国', '萧让', '裴宣', '欧鹏', '邓飞', '燕顺', '杨林', '凌振', '蒋敬', '吕方', '郭盛', '安道全', '皇甫端', '王英', '扈三娘', '鲍旭', '樊瑞', '孔明', '孔亮', '项充', '李衮', '金大坚', '马麟', '童威', '童猛', '孟康', '侯健', '陈达', '杨春', '郑天寿', '陶宗旺', '宋清', '乐和', '龚旺', '丁得孙', '穆春', '曹正', '宋万', '杜迁', '薛永', '李忠', '周通', '汤隆', '杜兴', '邹渊', '邹润', '朱贵', '朱富', '施恩', '蔡福', '蔡庆', '李立', '李云', '焦挺', '石勇', '孙新', '顾大嫂', '张青', '孙二娘', '王定六', '郁保四', '白胜', '时迁', '段景住'];
//进入时间数组
var attendTimeArr = ["08:55", "09:18", "08:28", "08:56", "08:08", "08:37", "08:47", "08:10", "08:42", "08:23", "09:29", "08:56", "08:38", "08:35", "08:22", "08:21", "10:43", "09:06", "09:59", "08:54", "08:44", "08:52", "08:12", "08:28", "08:06", "08:41", "08:59", "09:54", "08:26", "08:03", "08:15", "09:36", "08:02", "08:45", "08:50", "10:33", "08:46", "08:45", "08:29", "09:40", "09:53", "08:12", "08:47", "08:53", "09:36", "08:52", "08:51", "08:37", "08:17", "08:36", "08:08", "10:39", "08:26", "08:41", "08:54", "08:32", "08:43", "08:33", "08:27", "10:47", "08:49", "10:09", "08:30", "08:19", "08:36", "08:07", "08:21", "08:58", "08:51", "08:41", "08:14", "10:43", "10:07", "08:15", "08:58", "08:34", "08:31", "09:08", "10:29", "09:08", "09:25", "08:10", "08:19", "08:39", "08:43", "09:59", "08:43", "10:07", "08:08", "09:40", "08:05", "08:43", "10:22", "09:21", "08:22", "08:27", "08:26", "09:34", "08:38", "09:13","08:52", "09:20", "08:02", "09:36", "09:28", "08:40", "09:04", "08:49", "08:28", "08:25", "09:13", "08:03", "08:05", "09:36", "08:24", "08:19", "08:39", "10:15", "09:51", "08:09", "08:08", "08:55", "08:16", "08:05", "08:24", "09:29", "09:40", "08:11", "09:33", "08:41", "10:03", "10:41", "08:44", "09:26", "08:12", "10:54", "08:20", "08:27", "08:25", "08:54", "08:11", "08:25", "08:52", "08:21", "08:21", "09:02", "08:38", "10:49", "08:52", "10:47", "08:07", "08:35", "08:07", "08:50", "09:10", "08:10", "08:42", "10:30", "10:34", "10:22", "10:28", "10:15", "09:15", "10:14", "08:51", "09:13", "09:23", "08:22", "08:21", "08:37", "08:12", "08:59", "09:21", "09:04", "08:57", "08:02", "10:31", "10:21", "09:08", "09:39", "10:57", "10:03", "10:49", "08:44", "08:57", "09:53", "08:14", "08:58", "08:50", "08:11", "08:06", "09:33", "09:21", "09:14", "08:42", "08:16", "08:18", "09:31", "08:26", "08:04","08:37", "08:01", "08:27", "09:36", "08:29", "10:09", "08:37", "08:55", "08:28", "08:01", "09:58", "08:03", "10:55", "10:14", "08:46", "08:58", "08:31", "08:06", "08:59", "08:42", "10:06", "09:08", "08:53", "08:43", "08:35", "09:37", "08:59", "08:01", "08:07", "08:54", "09:20", "09:35", "08:46", "08:03", "08:07", "08:42", "08:03", "08:29", "10:12", "10:20", "10:15", "08:51", "08:11", "08:30", "09:11", "10:41", "09:37", "09:04", "08:16", "08:22", "08:21", "08:04", "08:41", "09:26", "09:59", "08:30", "08:46", "09:13", "08:10", "08:44", "08:25", "08:52", "08:11", "09:15", "08:14", "08:33", "08:47", "08:28", "08:08", "08:25", "08:26", "08:03", "08:57", "08:05", "08:23", "08:41", "09:47", "09:38", "08:21", "10:45", "08:28", "09:33", "08:48", "09:06", "08:50", "08:28", "10:53", "08:21", "10:55", "08:05", "08:40", "08:28", "08:43", "10:53", "08:07", "10:33", "08:23", "09:16", "08:21", "10:57", "09:18", "09:07", "08:14", "08:04", "08:15", "10:43", "08:53", "10:37", "08:59", "08:28", "09:47", "10:26","08:21","08:33","08:51", "08:11", "08:46"];
//离开时间数组
var departureTimeArr= ["20:15", "20:35", "20:41", "20:56", "20:48", "19:43", "19:53", "20:47", "18:05", "20:31", "19:11", "20:48", "20:41", "20:55", "18:41", "19:41", "20:37", "20:28", "20:38", "20:16", "20:54", "20:11", "20:56", "20:51", "20:50", "20:47", "20:37", "20:52", "20:28", "20:01", "20:07", "20:08", "18:34", "19:13", "20:37", "20:36", "20:52", "20:54", "19:15", "18:09", "20:03", "20:18", "20:57", "20:44", "19:14", "20:29", "20:04", "20:57", "20:07","19:55", "20:36", "20:27", "20:37", "20:50", "20:17", "20:06", "19:30", "20:26", "20:14", "19:06", "18:45", "20:01", "20:53", "20:42", "20:33", "20:23", "20:57", "20:40", "20:34", "19:18", "20:26", "20:12", "19:36", "20:01", "20:16", "20:11", "20:29", "20:57", "20:55", "20:02", "20:53", "18:49", "20:33", "20:56", "19:46", "20:05", "18:11", "20:30", "18:41", "20:43", "20:06", "20:30", "20:27", "20:50", "19:39", "19:40", "19:16", "20:10", "19:38", "20:59","20:14", "20:19", "20:13", "20:31", "20:29", "19:25", "20:29", "20:33", "20:57", "18:26", "20:29", "19:48", "20:21", "20:31", "20:51", "19:55", "20:42", "18:32", "18:33", "18:49", "20:59", "20:03", "19:31", "20:30", "20:11", "20:37", "19:09", "20:28", "20:26", "20:43", "20:20", "20:12", "20:43", "20:25", "18:45", "20:05", "19:19", "19:59", "19:51", "20:09", "18:04", "20:44", "20:35", "20:37", "19:55", "18:26", "20:33", "20:58", "19:34", "19:45", "20:20", "20:59", "20:07", "20:04", "20:49", "20:02", "19:55", "20:37", "20:38", "18:54", "20:27", "18:34", "20:09", "17:27", "19:49", "20:27", "20:10", "20:20", "18:26", "18:55", "19:44", "19:55", "18:05", "18:44", "20:58", "20:53", "20:03", "19:32", "17:16", "18:18", "20:48", "20:03", "20:28", "19:20", "19:02", "19:20", "20:05", "19:21", "19:30", "20:33", "20:08", "20:16", "20:08", "20:30", "20:23", "20:22", "19:54", "20:37", "20:47", "20:53","20:38", "20:39", "20:21", "20:43", "19:37", "17:09", "20:35", "20:48", "20:39", "19:21", "19:21", "20:24", "20:49", "18:36", "20:11", "20:07", "17:01", "20:46", "19:12", "19:09", "20:12", "20:34", "19:31", "19:08", "20:47", "20:22", "20:20", "20:59", "18:44", "18:02", "20:34", "20:48", "17:13", "20:47", "20:42", "19:11", "18:51", "19:40", "20:02", "20:30", "20:13", "20:25", "20:12", "20:33", "19:30", "20:46", "19:42", "20:16", "19:44", "19:31", "19:22", "20:53", "19:53", "18:12", "20:57", "20:13", "20:39", "20:36", "20:43", "20:53", "20:26", "20:23", "19:49", "20:47", "20:22", "20:05", "18:18", "20:48", "20:55", "20:48", "20:57", "20:51", "20:28", "19:51", "20:36", "20:01", "19:44", "19:17", "20:17", "20:20", "20:04", "20:59", "20:20", "20:31", "20:14", "20:04", "19:36", "19:38", "20:08", "20:09", "20:09", "20:24", "20:03", "20:35", "20:11", "20:51", "19:45", "20:14", "20:38", "20:54","20:34", "19:54", "20:15", "20:45", "20:16", "20:11", "20:47", "20:29", "20:24", "20:05", "20:03", "20:24", "20:47", "18:39", "20:29", "20:55", "20:43"];
//性别数组
var sexArr = ['男','女'];
//地址数组
var addressArr = ['艾欧尼亚','德玛西亚','诺克萨斯','巨神峰','祖安','皮尔特沃夫','弗雷尔卓德','比尔吉沃特','暗影岛','恕瑞玛','班德尔城','虚空之地','符文之地'];
//级别数组
var rankArr = ['大一','大二','大三','大四'];
//年级数组
var gradeArr = ['2013','2014','2015','2016','2016','2017','2018'];
var class1=0,class2=0,class3=0,class4=0,class5=0,class6=0,class7=0;
var classNums = [class1,class2,class3,class4,class5,class6,class7];

//遍历创建数据
for (var i=0;i<nameArr.length;i++){
    studentData.push({});
    studentData[i].id = 170100 + i;
    studentData[i].name = nameArr[i];
    if (i<=62){
        studentData[i].className = '计算机科学与技术';
        studentData[i].instructor = '高唯严';
    }else if(i>62 && i<=105){
        studentData[i].className = '电子商务';
        studentData[i].instructor = '苏小博';
    }else if(i>105 && i<=146){
        studentData[i].className = '会计学';
        studentData[i].instructor = '周珂宇';
    }else if(i>146 && i<=190){
        studentData[i].className = '信息工程';
        studentData[i].instructor = '李文红';
    }else if (i>190 && i<=225){
        studentData[i].className = '商务英语';
        studentData[i].instructor = '肖福麟';
    } else if(i>225 && i<=261){
        studentData[i].className = '算法工程';
        studentData[i].instructor = '李茂';
    }else if(i>261 && i<=317){
        studentData[i].className = '播音主持';
        studentData[i].instructor = '邓旭梅';
    }
    studentData[i].sex = sexArr[Math.round(Math.random())];
    studentData[i].age = Math.ceil(Math.random()*7+18);
    var year = 2019 - studentData[i].age;
    var month = parseInt(Math.random()*11)+1;
    month = month<10? '0'+String(month):String(month);
    var day = parseInt(Math.random()*29)+1;
    day = day<10? '0'+String(day):String(day);
    studentData[i].birthDate = year+'-'+month+'-'+day;
    var tel = String(180) + String(parseInt(Math.random()*10))+String(parseInt(Math.random()*10))+String(parseInt(Math.random()*10))+String(parseInt(Math.random()*10))+
        String(parseInt(Math.random()*10))+String(parseInt(Math.random()*10))+String(parseInt(Math.random()*10))+String(parseInt(Math.random()*10));
    studentData[i].tel = tel;
    studentData[i].address = addressArr[parseInt(Math.random()*11)+1];
    studentData[i].rank = rankArr[Math.round(Math.random()*3)];
    studentData[i].attendTime = attendTimeArr[i];
    studentData[i].departureTime = departureTimeArr[i];
    var reg = /\d/g;
    var bt = Number(studentData[i].attendTime.split(":").join(""));
    var et = Number(studentData[i].departureTime.split(":").join(""))
    if(studentData[i].attendTime == "" && studentData[i].departureTime==""){
        studentData[i].status = "旷课";
    }else if (bt <= 900 && et >= 2000){
        studentData[i].status = "正常";
    }else if(bt > 900 && et >= 2000){
        studentData[i].status = "迟到";
    }else if(bt <= 900 && et < 2000){
        studentData[i].status = "早退";
    }else{
        studentData[i].status = "旷课";
    }
    studentData[i].grade = gradeArr[Math.round(Math.random()*6)];
}


//班级名数组
var classNameArr = ['计算机科学与技术','电子商务','会计学','信息工程','商务英语','算法工程','播音主持'];
//班主任数组
var instructorArr = ['高唯严','苏小博', '周珂宇','李文红','肖福麟','李茂','邓旭梅'];
//遍历班级人数
for (var j=0;j<studentData.length;j++){
    if (studentData[j].className == '计算机科学与技术'){
        classNums[0]++;
    }else  if(studentData[j].className == '电子商务'){
        classNums[1]++;
    }else if(studentData[j].className == '会计学'){
        classNums[2]++;
    }else if(studentData[j].className == '信息工程'){
        classNums[3]++;
    }else if (studentData[j].className == '商务英语') {
        classNums[4]++;
    }else if(studentData[j].className == '算法工程'){
        classNums[5]++;
    }else if(studentData[j].className == '播音主持'){
        classNums[6]++;
    }
}
for (var i=0;i<classNameArr.length;i++){
    classData.push({});
    classData[i].id = 170100+(i*100);
    classData[i].className = classNameArr[i];
    classData[i].nums = classNums[i];
    classData[i].instructor = instructorArr[i];
    classData[i].grade = gradeArr[i];
    if (Number(classData[i].grade ) <2015){
        classData[i].status = '已毕业'
    } else if (Number(classData[i].grade ) ==2015) {
        classData[i].status = '大四';
    }else if (Number(classData[i].grade ) ==2016) {
        classData[i].status = '大三';
    }else if (Number(classData[i].grade ) ==2017) {
        classData[i].status = '大二';
    }else if (Number(classData[i].grade ) ==2018) {
        classData[i].status = '大一';
    }
}

//部门数据
var departData= [
            {
                'id':101,
                'name':'教务处',
                'num':6,
                'des':'负责学校教务管理'
            },
            {
                'id':102,
                'name':'财务处',
                'num':2,
                'des':'负责学校财务'
            },
            {
                'id':103,
                'name':'保卫处',
                'num':3,
                'des':'负责学校安全秩序'
            },
            {
                'id':104,
                'name':'人事处',
                'num':3,
                'des':'负责人事管理'
            }
];


//职工数据
var staffArr= {
    'data': {
        "total":14,
        "records":[
            {
                'id':10001,
                'name':'苏小博',
                'tel':'18205301154',
                'post':'高级教师',
                'sex':'男',
                'depart':'教务处',
                'email':'842016543@qq.com',
                'birth':'1996-08-09'
            },
            {
                'id':10002,
                'name':'周珂宇',
                'tel':'18085063205',
                'post':'中级教师',
                'sex':'男',
                'depart':'教务处',
                'email':'653154650@qq.com',
                'birth':'1996-12-11'
            },
            {
                'id':10003,
                'name':'高唯严',
                'tel':'18283607560',
                'post':'高级教师',
                'sex':'男',
                'depart':'财务处',
                'email':'805730923@qq.com',
                'birth':'1996-08-09'
            },
            {
                'id':10004,
                'name':'李文红',
                'tel':'18035956542',
                'post':'高级教师',
                'sex':'男',
                'depart':'保卫处',
                'email':'410648700@qq.com',
                'birth':'1990-01-25'
            },{
                'id':10005,
                'name':'肖福麟',
                'tel':'18297563230',
                'post':'高级教师',
                'sex':'男',
                'depart':'人事处',
                'email':'154862155@qq.com',
                'birth':'1994-04-16'
            },
            {
                'id':10006,
                'name':'邓旭梅',
                'tel':'18033654295',
                'post':'高级教师',
                'sex':'女',
                'depart':'人事处',
                'email':'321560311@qq.com',
                'birth':'1996-07-19'
            },
            {
                'id':10007,
                'name':'李茂',
                'tel':'18084863285',
                'post':'中级教师',
                'sex':'男',
                'depart':'教务处',
                'email':'156487605@qq.com',
                'birth':'1995-04-20'
            },
            {
                'id':10008,
                'name':'周飞',
                'tel':'18283607560',
                'post':'高级教师',
                'sex':'男',
                'depart':'教务处',
                'email':'540123956@qq.com',
                'birth':'1987-05-22'
            },
            {
                'id':10009,
                'name':'周润发',
                'tel':'18079530516',
                'post':'高级教师',
                'sex':'男',
                'depart':'教务处',
                'email':'805635923@qq.com',
                'birth':'1965-03-25'
            },
            {
                'id':10010,
                'name':'刘德华',
                'tel':'18008265976',
                'post':'中级教师',
                'sex':'男',
                'depart':'保卫处',
                'email':'290894703@qq.com',
                'birth':'1970-10-02'
            },
            {
                'id':10011,
                'name':'李连杰',
                'tel':'18086853261',
                'post':'中级教师',
                'sex':'男',
                'depart':'保卫处',
                'email':'360721225@qq.com',
                'birth':'1962-11-11'
            },
            {
                'id':10012,
                'name':'马云',
                'tel':'18078763320',
                'post':'高级教师',
                'sex':'男',
                'depart':'人事处',
                'email':'105197790@qq.com',
                'birth':'1969-04-30'
            },
            {
                'id':10013,
                'name':'碧昂丝',
                'tel':'18076549708',
                'post':'高级教师',
                'sex':'女',
                'depart':'财务处',
                'email':'107194389@qq.com',
                'birth':'1990-02-05'
            },
            {
                'id':10014,
                'name':'本泽马',
                'tel':'18231475682',
                'post':'高级教师',
                'sex':'男',
                'depart':'教务处',
                'email':'194280557@qq.com',
                'birth':'1987-08-15'
            }
        ]
    }
};


//登录数据
var usersArr= {
    'data': {
        'total':3,
        'records': [
            {
                username: "admin",
                password: 123456,
                role: 1,
                name: "渣渣辉",
                age: "22",
                taste: "看书",
                email: "admin@163.com",
                tel: "15212449023",
                img: "../images/information/admin.jpg",
                job: "管理员",
                means: "1"

            }, {
                username: "teacher",
                password: 654321,
                role: 2,
                name: "古力哪吒",
                age: "24",
                taste: "旅游",
                email: "teacher@163.com",
                tel: "15211350235",
                img: "../images/information/teacher.jpg",
                job: "老师",
                means: "2"

            }, {
                username: "president",
                password: 111111,
                role: 3,
                name: "古田乐",
                age: "46",
                taste: "围棋",
                email: "pre@163.com",
                tel: "13320237021",
                img: "../images/information/boss.jpg",
                job: "校长",
                means: "3"
            }
        ]
    }
};



// 所有公告
var publishDatas = [
    {
    publishBanji: '全校师生',
    publishTit: '关于寒假的放假通知',
    publishCont: '2019年中小学幼儿园寒假即将开始。1月14日，市教育局发布《关于做好2019年中小学幼儿园寒假工作的通知》。通知明确：1月26日至2月17日为寒假，2月18日上课。各地各校要严格按要求执行放假时间，科学合理安排学生假期生活。同时，各地各校严禁在寒假期间组织学生进行集体补课、上新课或以各种名目举办文化课补习班、培优班、提高班等。',
    publishTime: '2019-01-15 下午3:40:20',
    pubAuthority: 3,
    index: 11,
    change: ''
},
    {
        publishBanji: '大一&nbsp;&nbsp;电子商务',
        publishTit: '对苏小博、周珂宇同学聚众斗殴的处罚',
        publishCont: '根据《治安管理处罚法》第四十三条规定：“殴打他人的，或者故意伤害他人身体的，处五日以上十日以下拘留，并处二百元以上五百元以下罚款;情节较轻的，处五日以下拘留或者五百元以下罚款。',
        publishTime: '2019-01-10 上午11:40:15',
        pubAuthority: 1,
        index: 10,
        change: ''
    },
    {
        publishBanji: '全校师生',
        publishTit: '教育局领导来我校视察',
        publishCont: '啊啊啊 啊啊啊啊啊啊啊',
        publishTime: '2019-01-08 下午3:40:29',
        pubAuthority: 3,
        index: 9,
        change: ''
    },
    {
        publishBanji: '全校师生',
        publishTit: '期末考试的成绩查询通道已经开启',
        publishCont: '可以可以可以可以可以',
        publishTime: '2019-01-03 下午5:15:12',
        pubAuthority: 3,
        index: 8,
        change: ''
    },
    {
        publishBanji: '大三&nbsp;&nbsp;信息工程',
        publishTit: '期末考试安排',
        publishCont: '明天考试',
        publishTime: '2019-01-03 下午3:40:20',
        pubAuthority: 3,
        index: 7,
        change: ''
    },
    {
        publishBanji: '全校师生',
        publishTit: '喜迎新生',
        publishCont: 'hahahahah',
        publishTime: '2018-09-01 上午9:40:30',
        pubAuthority: 3,
        index: 6,
        change: ''
    },
    {
        publishBanji: '大三&nbsp;&nbsp;信息工程',
        publishTit: '通知通知',
        publishCont: '通知通知通知通知',
        publishTime: '2018-08-20 下午3:40',
        pubAuthority: 3,
        index: 5,
        change: ''
    },
    {
        publishBanji: '大二&nbsp;&nbsp;电子商务',
        publishTit: '马云来校参观',
        publishCont: '准备打他',
        publishTime: '2018-08-05 下午3:40',
        pubAuthority: 3,
        index: 4,
        change: ''
    },
    {
        publishBanji: '大四&nbsp;&nbsp;播音主持',
        publishTit: '通知通知',
        publishCont: 'hahahahah',
        publishTime: '2018-07-20 下午3:40',
        pubAuthority: 3,
        index: 3,
        change: ''
    },
    {
        publishBanji: '全校师生',
        publishTit: '通知通知',
        publishCont: '看见了来了',
        publishTime: '2018-06-30 下午3:40',
        pubAuthority: 3,
        index: 2,
        change: ''
    },
    {
        publishBanji: '大四&nbsp;&nbsp;播音主持',
        publishTit: '通知通知',
        publishCont: 'hahahahah',
        publishTime: '2018-05-12 下午3:40',
        pubAuthority: 3,
        index: 1,
        change: ''
    },
    {
        publishBanji: '大三&nbsp;&nbsp;计算机科学与技术',
        publishTit: '通知通知',
        publishCont: '怒恩你你你你你你你hah',
        publishTime: '2018-04-30 下午3:40',
        pubAuthority: 3,
        index: 0,
        change: ''
    }];